Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/Timer32_356.0.xml
<module id="Timer32" HW_revision="356.0">
    <register id="T32LOAD1" width="32" offset="0x0" internal="0" description="Timer 1 Load Register">
    </register>
    <register id="T32VALUE1" width="32" offset="0x4" internal="0" description="Timer 1 Current Value Register">
    </register>
    <register id="T32CONTROL1" width="32" offset="0x8" internal="0" description="Timer 1 Timer Control Register">
        <bitfield id="ONESHOT" description="Selects one-shot or wrapping counter mode" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="WRAPPING" value="0x0" description="wrapping mode"/>
            <bitenum id="ONESHOT" value="0x1" description="one-shot mode"/>
        </bitfield>
        <bitfield id="SIZE" description="Selects 16 or 32 bit counter operation" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="16BIT" value="0x0" description="16-bit counter"/>
            <bitenum id="32BIT" value="0x1" description="32-bit counter"/>
        </bitfield>
        <bitfield id="PRESCALE" description="Prescale bits" begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="PRESCALE_0" value="0x0" description="0 stages of prescale, clock is divided by 1"/>
            <bitenum id="PRESCALE_1" value="0x1" description="4 stages of prescale, clock is divided by 16"/>
            <bitenum id="PRESCALE_2" value="0x2" description="8 stages of prescale, clock is divided by 256"/>
        </bitfield>
        <bitfield id="IE" description="Interrupt enable bit" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Timer interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Timer interrupt enabled"/>
        </bitfield>
        <bitfield id="MODE" description="Mode bit" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="FREE" value="0x0" description="Timer is in free-running mode"/>
            <bitenum id="PERIODIC" value="0x1" description="Timer is in periodic mode"/>
        </bitfield>
        <bitfield id="ENABLE" description="Enable bit" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Timer disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Timer enabled"/>
        </bitfield>
    </register>
    <register id="T32INTCLR1" width="32" offset="0xC" internal="0" description="Timer 1 Interrupt Clear Register">
    </register>
    <register id="T32RIS1" width="32" offset="0x10" internal="0" description="Timer 1 Raw Interrupt Status Register">
        <bitfield id="RAW_IFG" description="Raw interrupt status" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="T32MIS1" width="32" offset="0x14" internal="0" description="Timer 1 Interrupt Status Register">
        <bitfield id="IFG" description="Enabled interrupt status" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="T32BGLOAD1" width="32" offset="0x18" internal="0" description="Timer 1 Background Load Register">
    </register>
    <register id="T32LOAD2" width="32" offset="0x20" internal="0" description="Timer 2 Load Register">
    </register>
    <register id="T32VALUE2" width="32" offset="0x24" internal="0" description="Timer 2 Current Value Register">
    </register>
    <register id="T32CONTROL2" width="32" offset="0x28" internal="0" description="Timer 2 Timer Control Register">
        <bitfield id="ONESHOT" description="Selects one-shot or wrapping counter mode" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="WRAPPING" value="0x0" description="wrapping mode"/>
            <bitenum id="ONESHOT" value="0x1" description="one-shot mode"/>
        </bitfield>
        <bitfield id="SIZE" description="Selects 16 or 32 bit counter operation" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="16BIT" value="0x0" description="16-bit counter"/>
            <bitenum id="32BIT" value="0x1" description="32-bit counter"/>
        </bitfield>
        <bitfield id="PRESCALE" description="Prescale bits" begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="PRESCALE_0" value="0x0" description="0 stages of prescale, clock is divided by 1"/>
            <bitenum id="PRESCALE_1" value="0x1" description="4 stages of prescale, clock is divided by 16"/>
            <bitenum id="PRESCALE_2" value="0x2" description="8 stages of prescale, clock is divided by 256"/>
        </bitfield>
        <bitfield id="IE" description="Interrupt enable bit" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Timer interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Timer interrupt enabled"/>
        </bitfield>
        <bitfield id="MODE" description="Mode bit" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="FREE" value="0x0" description="Timer is in free-running mode"/>
            <bitenum id="PERIODIC" value="0x1" description="Timer is in periodic mode"/>
        </bitfield>
        <bitfield id="ENABLE" description="Enable bit" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Timer disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Timer enabled"/>
        </bitfield>
    </register>
    <register id="T32INTCLR2" width="32" offset="0x2C" internal="0" description="Timer 2 Interrupt Clear Register">
    </register>
    <register id="T32RIS2" width="32" offset="0x30" internal="0" description="Timer 2 Raw Interrupt Status Register">
        <bitfield id="RAW_IFG" description="Raw interrupt status" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="T32MIS2" width="32" offset="0x34" internal="0" description="Timer 2 Interrupt Status Register">
        <bitfield id="IFG" description="Enabled interrupt status" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="T32BGLOAD2" width="32" offset="0x38" internal="0" description="Timer 2 Background Load Register">
    </register>
</module>
